# message scripts
intro = '''
안녕하세요 :)
저는 가사와 앨범커버 작업을 도와주는 봇이에요.

만들고 싶은 음악의 주제를 알려주세요.
어울리는 노래 가사와 앨범 커버를 만들어 드릴게요.
(ex. 자기 위로, 헤어진 전 여자친구에 대한 그리움)
'''

new_topic = '''
새롭게 만들고 싶은 음악의 주제를 알려주세요.
어울리는 노래 가사와 앨범 커버를 만들어 드릴게요.
(ex. 자기 위로, 헤어진 전 여자친구에 대한 그리움)
'''

add_detail = '''
가사에 포함하고 싶은 내용이나 상황을 설명해주세요. 
(ex. 회색 도시 해가 지면, 그때 넌 참 예뻤었지)
따로 지정하고 싶지 않다면 0 을 입력해주세요.
'''

add_except = '''
가사에 포함하고 싶지 않은 표현이 있다면 알려주세요.
(ex. 힘들다, 우울, 보고 싶다)
따로 지정하고 싶지 않다면 0 을 입력해주세요.
'''

add_genre = '''
생각하고 있는 장르가 있다면 알려주세요.
(ex. K-pop, 동요)
없다면 0 을 입력해주세요.
'''

add_lang = '''
어떤 언어로 가사를 만들까요? 
(ex. '한국어', '한국어, 일부 영어 소절')
없다면 0 를 입력해주세요. 한국어로 만들어 드릴게요.
'''

creating_lyric = '''
이 내용으로 가사를 만들어볼게요.
'''

creating_cover = '''
주제와 어울리는 앨범 커버를 제작해 볼게요.
'''

continue_cover = '''
'이어서 앨범 커버를 생성할까요?'
'''

feedback = '''
새로운 주제로 다시 가사를 만드려면 /start 또는 /newtopic 을 입력해주세요.
'''

invalid_status = '''
오류가 발생했어요.
다시 작업을 시작하려면 /start 또는 /newtopic 을 입력해주세요.
'''